system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libOpenFOAM.so"
    "libincompressibleTurbulenceModel.so"
    "libincompressibleRASModels.so"
);

application     simpleFoam;

startFrom       startTime; // latestTime;

startTime       0;

stopAt endTime;

endTime  100;

deltaT          1;

writeControl    timeStep;

writeInterval 10;

purgeWrite 0;


//- Uncomment to have regular (every 2 hours of run time) restart files
//secondaryWriteControl    cpuTime; // runtime
//secondaryWriteInterval   7200;    // seconds
//secondaryPurgeWrite      1;       // keep all but last dump


writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

turbulenceStartTime 50;

functions
{

    #include "readFields"
    #include "minMax"

	static_pressure_INLET
	{
		type            faceSource;
		functionObjectLibs ("libfieldFunctionObjects.so");
		enabled         true;
		outputControl   timeStep;
		log             true;
		valueOutput     true;
		source          patch;
		surfaceFormat	null;
		sourceName      WB_inlet;
		operation       areaAverage;
		fields 		( p );
	}
}


// ************************************************************************* //
