0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);

boundaryField
{
  WB_inlet
  {
    type            fixedValue;
    value uniform (3.68 0 0);
  }

  WB_outlet
  {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
  }

  WB_fins
  {
    type fixedValue;
    value uniform (0 0 0);
  }

  WB_walls
  {
    type fixedValue;
    value uniform (0 0 0);
  }

  "procBoundary.*"
  {
    type processor;
    value uniform (0 0 0);
  }
    #include "include/frontBackUpperPatches"

}

