system/fvSolutionICCG
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

	p
	{
          solver          ICCG;
          preconditioner  DIC;
          tolerance       1e-06;
          relTol          0.05;
	}
	
	U
	{
		solver          smoothSolver;
		smoother        GaussSeidel;
		tolerance       1e-06;
		relTol          0.1;
	}
	
	h
	{
		solver          smoothSolver;
		smoother        GaussSeidel;
		tolerance       1e-06;
		relTol          0.1;
	}
	
	k
	{
		solver          smoothSolver;
		smoother        GaussSeidel;
		tolerance       1e-06;
		relTol          0.1;
	}
	
	epsilon
	{
		solver          smoothSolver;
		smoother        GaussSeidel;
		tolerance       1e-06;
		relTol          0.1;
	}
	
	R
	{
		solver          smoothSolver;
		smoother        GaussSeidel;
		tolerance       1e-06;
		relTol          0.1;
	}
	
	nuTilda
	{
		solver          smoothSolver;
		smoother        GaussSeidel;
		tolerance       1e-06;
		relTol          0.1;
	}
	
	omega
	{
		solver          smoothSolver;
		smoother        GaussSeidel;
		tolerance       1e-06;
		relTol          0.1;
	}
	
	T
	{
		solver          smoothSolver;
		smoother        GaussSeidel;
		tolerance       1e-05;
		relTol          0;
	}

}

SIMPLE
{
    nNonOrthogonalCorrectors     0;
    nUCorrectors                 0;
    convergence                  1e-3;
    pressureImplicitPorosity     false;
}

relaxationFactors
{
    p           0.3;
    U           0.7;
    k           0.7;
    epsilon     0.7;
    omega       0.7;
    h           0.7;
}


potentialFlow
{
    nNonOrthogonalCorrectors 20;
}

// ************************************************************************* //
